# Cisco Packet Tracer Cheatsheet

## Tartalomjegyzék
1. [Topológia](#topológia)
    - [Eszközök és Kapcsolatok](#eszközök-és-kapcsolatok)
    - [IP címek](#ip-címek)
    - [Jelszavak](#jelszavak)
    - [VLAN-ok](#vlan-ok)
    - [DHCP](#dhcp)
    - [SSH](#ssh)
    - [Vezeték nélküli hálózat](#vezeték-nélküli-hálózat)
2. [Alap beállítások a Switchen](#alap-beállítások-a-switchen)
    - [Eszköznév beállítása](#eszköznév-beállítása)
    - [Jelszavak titkosítása](#jelszavak-titkosítása)
    - [Konfiguráció mentése](#konfiguráció-mentése)
    - [Enable jelszó beállítása](#enable-jelszó-beállítása)
    - [Console jelszó beállítása](#console-jelszó-beállítása)
    - [Port konfigurálása](#port-konfigurálása)
    - [Felügyeleti IP-cím beállítása a Switch-en](#felügyeleti-ip-cím-beállítása-a-switch-en)
3. [SSH hozzáférés konfigurálása](#ssh-hozzáférés-konfigurálása)
4. [DHCP konfigurálása a Routeren](#dhcp-konfigurálása-a-routeren)
5. [Vezeték nélküli hálózat konfigurálása](#vezeték-nélküli-hálózat-konfigurálása)

## Topológia

### Eszközök és Kapcsolatok
- **Legyakrabban előforduló eszközök:**
    - Router
    - Home Router
    - Switch
    - PC
    - Laptop
    - Server

- **Eszközök összekötése:**
    - Azonos eszközök között: **keresztkötésű (szaggatott) kábel**
    - Különböző eszközök között: **egyeneskötésű (normál) kábel**

### IP címek
- Az IP címek megfelelő kiosztása az eszközök között.

### Jelszavak
- Jelszavak beállítása és titkosítása a biztonság érdekében.

### VLAN-ok
- VLAN-ok létrehozása és konfigurálása a hálózat szegmentálásához.

### DHCP
- DHCP konfigurálása a dinamikus IP címkiosztáshoz.

### SSH
- SSH konfigurálása a biztonságos távmenedzsmenthez.

### Vezeték nélküli hálózat
- Vezeték nélküli hálózat beállítása és konfigurálása.

### Leggyakoribb CLI parancsok

#### Alapok
- `enable` vagy `en` - Privilegizált módba lépés
- `configure terminal` vagy `conf t` - Konfigurációs módba lépés
- `show running-config` - Jelenlegi konfiguráció megjelenítése
- `copy running-config startup-config` - Konfiguráció mentése
- `write memory` vagy `wr` - Konfiguráció mentése
- `exit` - Kilépés a konfigurációs módból

#### Jelszó beállítások
- `enable password Gyar1ena` - Normál jelszó beállítása
- `enable secret Gyar1ena` - Titkosított jelszó beállítása
- `line console 0` - Console jelszó beállítása
- `password Gyar1Con` - Console jelszó beállítása
- `login` - Bejelentkezés engedélyezése

#### Interfész beállítások
- `interface gigabitEthernet 0/1` - Interfész kiválasztása
- `ip address 10.20.30.40 255.255.255.0` - IP cím beállítása
- `no shutdown` - Interfész bekapcsolása

#### VLAN beállítások
- `vlan 1` - VLAN létrehozása
- `name VLAN1` - VLAN nevének beállítása
- `exit` - Kilépés a VLAN beállításokból

## Alap beállítások a Switchen

### Eszköznév beállítása
```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname K1-SW1
```

### Jelszavak titkosítása
```bash
K1-SW1(config)# service password-encryption
```

### Konfiguráció mentése
A konfiguráció mentéséhez a következő parancsokat lehet használni:
1. 
    ```bash
    K1-SW1# copy running-config startup-config
    ```
2. 
    ```bash
    K1-SW1# write memory
    ```
3. 
    ```bash
    K1-SW1# wr
    ```

### Enable jelszó beállítása
**Enable jelszó beállítása (normál jelszó):**
```bash
Switch(config)# enable password <Ide Jön a jelszó>
Switch(config)# end
Switch# exit
```

**Enable jelszó beállítása (titkosított jelszó):**
```bash
Switch(config)# enable secret <Ide Jön a jelszó>
Switch(config)# end
Switch# exit
```

### Console jelszó beállítása
```bash
Switch(config)# line con 0
Switch(config-line)# password Gyar1Con
Switch(config-line)# login
Switch(config-line)# end
Switch# exit
```

### Port konfigurálása
```bash
Switch(config)# interface gigabitEthernet 0/1
Switch(config-if)# ip address 10.1.2.5 255.255.255.252
Switch(config-if)# no shutdown
```

### Felügyeleti IP-cím beállítása a Switch-en
**Felügyeleti IP-cím adása a kapcsolónak (itt VLAN 1 a felügyeleti VLAN):**
```bash
Switch(config)# int vlan 1
Switch(config-if)# ip address 10.0.0.1 255.0.0.0
Switch(config-if)# no shutdown
```

## SSH hozzáférés konfigurálása
```bash
Router(config)# hostname router1
Router(config)# ip domain-name teszt.hu
Router(config)# crypto key generate rsa
    How many bits in the modulus [512]: 1024
Router(config)# ip ssh version 2
Router(config)# username admin password cisco2
Router(config)# line vty 0 15
Router(config-line)# login local
Router(config-line)# transport input ssh
```

## DHCP konfigurálása a Routeren
```bash
Router(config)# ip dhcp pool <pool-name>
Router(dhcp-config)# network 192.168.1.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.1.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit
Router(config)# ip dhcp excluded-address 192.168.1.1 192.168.1.10
```

## Vezeték nélküli hálózat konfigurálása
1. Válaszd ki a home routert.
2. Nyisd meg a GUI felületet.
3. Állítsd be a megfelelő IP címet a Routernek.
4. Állítsd be a subnet maskot.
5. Állítsd be a DHCP-t a feladatnak megfelelően.
6. Állítsd be a DNS szerver(eke)t.
7. Mentés.
8. Ellenőrizd a beállításokat hogy biztosan elmentette-e, mert a Packet Tracer néha nem ment megfelelően.

### Vezeték nélküli hálózat beállítása
1. Menj a Wireless fülre.
2. Állítsd be a vezeték nélküli hálózat nevét (SSID) és a WPA2-PSK titkosítást (vagy amit a feladat kér).
3. Állítsd be a kulcsot.
4. Mentés és bezárás.
5. Ellenőrizd a beállításokat hogy biztosan elmentette-e, mert a Packet Tracer néha nem ment megfelelően.