# Cisco Packet Tracer Cheatsheet

## Tartalomjegyzék
1. [Alap- és biztonsági beállítások a Switchen](#alap-és-biztonsági-beállítások-a-switchen)
    - [Eszköznév beállítása](#eszköznév-beállítása)
    - [Jelszavak titkosítása](#jelszavak-titkosítása)
    - [Konfiguráció mentése](#konfiguráció-mentése)
    - [Enable jelszó beállítása](#enable-jelszó-beállítása)
    - [Console jelszó beállítása](#console-jelszó-beállítása)
    - [Port konfigurálása](#port-konfigurálása)
    - [Felügyeleti IP-cím beállítása a Switch-en](#felügyeleti-ip-cím-beállítása-a-switch-en)
2. [SSH hozzáférés konfigurálása](#ssh-hozzáférés-konfigurálása)
3. [DHCP konfigurálása a Routeren](#dhcp-konfigurálása-a-routeren)
4. [Vezeték nélküli hálózat konfigurálása](#vezeték-nélküli-hálózat-konfigurálása)

## Alap- és biztonsági beállítások a Switchen
### Eszköznév beállítása
```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname K1-SW1
```

### Jelszavak titkosítása
```bash
K1-SW1(config)# service password-encryption
```

### Konfiguráció mentése
    A konfiguráció mentéséhez a következő parancsokat lehet hasznáklni:

    1. 
        ```bash
        K1-SW1# copy running-config startup-config
        ```
    2. 
        ```bash
        K1-SW1# write memory
        ```
    3. 
        ```bash
        K1-SW1# wr
        ```

### Enable jelszó beállítása
**Enable jelszó beállítása (normál jelszó):**
```bash
Switch(config)# enable password Gyar1ena
Switch(config)# exit
```

**Enable jelszó beállítása (titkosított jelszó):**
```bash
Switch(config)# enable secret Gyar1ena
Switch(config)# exit
```

### Console jelszó beállítása
```bash
Switch(config)# line console 0
Switch(config-line)# password Gyar1Con
Switch(config-line)# login
```

### Port konfigurálása
```bash
Switch(config)# interface gigabitEthernet 0/1
Switch(config-if)# ip address 10.1.2.5 255.255.255.252
Switch(config-if)# no shutdown
```

### Felügyeleti IP-cím beállítása a Switch-en
**Felügyeleti IP-cím adása a kapcsolónak (itt VLAN 1 a felügyeleti VLAN):**
```bash
Switch(config)# int vlan 1
Switch(config-if)# ip address 10.0.0.1 255.0.0.0
Switch(config-if)# no shutdown
```

## SSH hozzáférés konfigurálása
```bash
Router(config)# hostname router1
Router(config)# ip domain-name teszt.hu
Router(config)# crypto key generate rsa
    How many bits in the modulus [512]: 1024
Router(config)# ip ssh version 2
Router(config)# username admin password cisco2
Router(config)# line vty 0 15
Router(config-line)# login local
Router(config-line)# transport input ssh
```

## Vezeték nélküli hálózat konfigurálása
1. Válaszd ki a home routert.
2. Nyisd meg a GUI felületet.
3. Állítsd be a megfelelő IP címet a Routernek.
4. Állítsd be a subnet maskot.
5. Állítsd be a DHCP-t a feladatnak megfelelően.
6. Állítsd be a DNS szerver(eke)t.
6. Mentés.
7. Ellenőrizd a beállításokat hogy biztosan elmentette-e, mert a packet tracer egy fos.

___________
1. Menj a Wireless fülre.
2. Állítsd be a vezeték nélküli hálózat nevét (SSID) és a WPA2-PSK titkosítást(vagy amit a feladat kér).
3. Állítsd be a kulcsot.
4. Mentés és bezárás.
5. Ellenőrizd a beállításokat hogy biztosan elmentette-e, mert a packet tracer egy fos.